# Создайте программу, которая определяет, является ли заданный год високосным. Изобразите блок-схему.


# Запрашиваем у пользователя ввод года и преобразуем его в целое число
year = int(input("Введите год: "))

# Проверяем условия для високосного года:
# 1. Год делится на 400 без остатка (например, 2000) ИЛИ
# 2. Год делится на 4 без остатка, но НЕ делится на 100 (например, 2024)
if (year % 400 == 0) or (year % 4 == 0 and year % 100 != 0):
    # Если условия выполняются, выводим сообщение о високосном годе
    print(f"{year} год - високосный")
else:
    # Если условия не выполняются, выводим сообщение о невисокосном годе
    print(f"{year} год - не високосный")
